In [1]:
import pandas as pd

In [2]:
df= pd.read_csv("house_prices.csv.zip")

In [3]:
df.columns

Index(['Index', 'Title', 'Description', 'Amount(in rupees)',
       'Price (in rupees)', 'location', 'Carpet Area', 'Status', 'Floor',
       'Transaction', 'Furnishing', 'facing', 'overlooking', 'Society',
       'Bathroom', 'Balcony', 'Car Parking', 'Ownership', 'Super Area',
       'Dimensions', 'Plot Area'],
      dtype='object')

In [4]:
df = df[['Carpet Area', 'Price (in rupees)']]
df.head()

  Carpet Area  Price (in rupees)
0    500 sqft             6000.0
1    473 sqft            13799.0
2    779 sqft            17500.0
3    530 sqft                NaN
4    635 sqft            18824.0

In [5]:
df['Carpet Area'] = df['Carpet Area'].str.replace(' sqft', '', regex=False)
df['Carpet Area'] = pd.to_numeric(df['Carpet Area'], errors='coerce')

In [6]:
df.dropna(inplace=True)

In [7]:
df.columns = ['Area', 'Price']

In [8]:
df.head()

    Area    Price
0  500.0   6000.0
1  473.0  13799.0
2  779.0  17500.0
4  635.0  18824.0
6  550.0   2538.0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 88348 entries, 0 to 187528
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Area    88348 non-null  float64
 1   Price   88348 non-null  float64
dtypes: float64(2)
memory usage: 2.0 MB

In [10]:
df.to_csv("clean_house_data.csv", index=False)